benchmarks/batching_results/llama-2-13b/_256__500/log_11937871.out
WARNING 11-18 09:31:20 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=42454, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=500, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/testing/llama-2-13b/_256__500', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=42454 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-13b --max-num-seqs=256', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     500       
Benchmark duration (s):                  60.89     
Total input tokens:                      125000    
Total generated tokens:                  115500    
Request throughput (req/s):              8.21      
Output token throughput (tok/s):         1896.96   
Total Token throughput (tok/s):          3949.94   
---------------Time to First Token----------------
Mean TTFT (ms):                          21680.12  
Median TTFT (ms):                        25150.49  
P99 TTFT (ms):                           53797.69  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.43     
Median TPOT (ms):                        54.95     
P99 TPOT (ms):                           106.29    
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.83     
Median ITL (ms):                         45.72     
P99 ITL (ms):                            219.48    
==================================================
Concurrent checker terminated
Server terminated